Repository: 84000/data-translation-memory
Catalog: toh557-v3.tmx
Source language: bo
Languages: en

source: སྡིག་པ་ཅན་གྱི་སེམས་ཅན་ཞིག་གིས་ཉ་ཁྲི་པོ་དེ་དག་གི་ཕྱིར་ཅི་ནས་ཀྱང་ཕྱིས་ཉ་དེ་དག་ལ་ཆུ་འབབ་པར་མི་འགྱུར་བ་དེ་ལྟ་བུའི་ཕྱོགས་ཀྱི་གཡང་ས་ཆེན་པོར་ཀླུང་དེ་ཕབ་བོ། །
en: At that time, a wicked being, in order to obtain those ten thousand fish, had caused the river to flow over a great cliff in that area so that subsequently there would be no water flowing to the fish.

source: དེས་དེ་མཐོང་ནས་བསམས་པ། ཀླུང་འདི་ནི་སྐྱེ་བོ་སྟོང་གིས་ཀྱང་སྲོལ་དེ་ཉིད་དུ་དབབ་པར་མི་ནུས་ན།
en: When Jalavāhana, the head merchant’s son, saw that, he thought, ‘Not even a thousand people could make the course of this river flow to that lake, so how would I alone be able to?’

source: བདག་གི་ལྟ་དབབ་པར་ག་ལ་ནུས་སྙམ་ནས་དེ་ཕྱིར་ལོག་གོ། །
en: He then returned.

source: རིགས་ཀྱི་ལྷ་མོ་དེ་ནས་ཚོང་དཔོན་གྱི་ཁྱེའུ་ཆུ་འབེབས་རིངས་པ་རིངས་པར་རྒྱལ་པོ་ལྷའི་དབང་ཕྱུག་འོད་ག་ལ་བ་དེར་སོང་སྟེ་ཕྱིན་ནས།
en: “Then, noble goddess, Jalavāhana, the head merchant’s son, hurriedly went to King Sureśvara­prabha.

source: རྒྱལ་པོ་ལྷའི་དབང་ཕྱུག་འོད་ཀྱི་རྐང་པ་ལ་མགོ་བོས་ཕྱག་འཚལ་ཏེ་ཕྱོགས་གཅིག་ཏུ་འདུག་ནས། དེ་དག་རྒྱུས་ནས་སྨྲས་ཏེ། བདག་གིས་ལྷའི་ཆབ་འོག་ཏུ་གྲོང་དང་། གྲོང་ཁྱེར་དང་། གྲོང་རྡལ་ཐམས་ཅད་དུ་སེམས་ཅན་གྱི་ནད་ཀྱི་རྒྱུན་ནི་བཀུམ་ན་གནས་ཆེ་གེ་མོ་ཞེས་བགྱི་བ་དེ་ན།
en: Having reached him, he bowed down his head to the feet of King Sureśvara­prabha, seated himself to one side, and told his story: ‘I had eliminated illness in all the villages, towns, and market towns within Your Majesty’s domain.

source: དགོན་པ་ན་ཡོད་པ་ཞེས་བགྱི་བའི་རྫིང་ཞིག་མཆིས་པ་དེ་ན་ཉ་ཁྲི་ཞིག་གནས་པ་དེ་ཆབ་དང་བྲལ་ནས་གདུགས་ཀྱིས་གདུངས་ཤིང་མཆིས་ཏེ།
en: In a certain place, there is a lake called Aṭavīsaṃbhavā, in which live ten thousand fish. They lack water and are being tormented by the sun.

source: ཇི་ལྟར་མི་རྣམས་ལ་སྩལ་བ་ལྟར་ཅི་ནས་དུད་འགྲོའི་སྐྱེ་གནས་སུ་གྱུར་པ་དེ་དག་ལ་ཡང་སྲོག་སྩོལ་བར་འཚལ་ན།
en: Just as I did for human beings, I wish to save the lives of those who have been born as animals.

source: ལྷས་གླང་པོ་ཆེ་ཉི་ཤུ་ཞིག་བདག་ལ་སྩལ་དུ་གསོལ།
en: Therefore, Your Majesty, I request twenty elephants from you.’

source: རྒྱལ་པོ་ལྷའི་དབང་ཕྱུག་འོད་ཀྱིས་སྨན་པའི་རྒྱལ་པོ་ཆེན་པོ་ལ་གླང་པོ་ཆེ་ཉི་ཤུ་ཞིག་བྱིན་ཅིག་ཅེས་བློན་པོ་རྣམས་ལ་བསྒོའོ། །
en: “King Sureśvara­prabha gave his ministers the command: ‘Give the great king of doctors twenty elephants!’

source: བློན་པོ་རྣམས་ཀྱིས་སྨྲས་པ།
en: “The ministers said to him, ‘Great being!

source: སེམས་ཅན་ཆེན་པོ་གླང་པོ་ཆེའི་ལྷས་ག་ལ་བ་དེར་སོང་ལ་གླང་པོ་ཆེ་ཉི་ཤུ་ཞིག་ཁྲིད་དེ། སེམས་ཅན་རྣམས་ལ་ཕན་གདགས་པ་དང་བདེ་བར་གྱིས་ཤིག །
en: Go to the elephant pen, take away twenty elephants, and bring benefit and happiness to beings!’

source: རིགས་ཀྱི་ལྷ་མོ་དེ་ནས་ཚོང་དཔོན་གྱི་ཁྱེའུ་ཆུ་འབེབས་རང་གི་བུ་ཆུའི་གོས་དང་། ཆུའི་སྙིང་པོ་དང་ལྷན་ཅིག་ཏུ་གླང་པོ་ཆེ་ཉི་ཤུ་ཁྲིད་ནས་གླང་པོ་ཆེའི་རྫི་བོ་ལས་བ་ལང་གི་རྐྱལ་པ་བརྒྱ་བླངས་ཏེ། སླར་ལོག་ནས་ཆུ་འབབ་ཅེས་བྱ་བའི་ཀླུང་ཆེན་པོ་གང་དུ་འབབ་པ་དེར་སོང་སྟེ།
en: “Then, noble goddess, Jalavāhana, the head merchant’s son, with his sons Jalāmbara and Jalagarbha, led away twenty elephants and obtained from the elephant keepers one hundred ox-leather bags, and then they returned, going to where the great river Jalāgamā flowed.

source: རྐྱལ་པ་དེ་དག་ཆུས་བཀང་ནས་གླང་པོ་ཆེའི་རྒྱབ་ཏུ་ཆུ་བཀལ་ཏེ། མྱུར་བ་མྱུར་བར་དགོན་པ་ན་ཡོད་པའི་རྫིང་ག་ལ་བ་དེར་སོང་ནས་ཕྱིན་པ་དང་། ཆུ་དེ་གླང་པོ་ཆེའི་སྟེང་ནས་ཕབ་སྟེ།
en: They filled those bags with water, loaded them onto the elephants, and hurried back to the lake in the wilderness.

source: ཕྱོགས་བཞི་ནས་རྫིང་བུ་ཆུས་བཀང་ནས་ཕྱོགས་བཞིར་འགྲོ་བ་དང་།
en: When they arrived there, they took down the water from the elephants, and from all four directions they filled the lake with water.

source: ཚོང་དཔོན་གྱི་ཁྱེའུ་ཆུ་འབེབས་གང་དང་གང་དུ་འགྲོ་བ་དེ་ལོགས་སུ་ཉ་ཁྲི་པོ་དག་ཀྱང་རྒྱུག་གོ། །
en: As Jalavāhana, the head merchant’s son, walked in the four directions, wherever he went, the ten thousand fish sped there.

source: རིགས་ཀྱི་ལྷ་མོ་དེ་ནས་ཚོང་དཔོན་གྱི་ཁྱེའུ་ཆུ་འབེབས་འདི་སྙམ་དུ་སེམས་ཏེ། ཅིའི་ཕྱིར་ཉ་ཁྲི་པོ་འདི་དག་བདག་ག་ལ་བ་དེ་ལོགས་སུ་རྒྱུག་སྙམ་མོ། །
en: “Then, noble goddess, Jalavāhana, the head merchant’s son, wondered, ‘Why are the ten thousand fish speeding to wherever I am?’

source: དེ་ཡང་འདི་སྙམ་དུ་སེམས་ཏེ། ཉ་ཁྲི་པོ་འདི་དག་ནི་བཀྲེས་པའི་མེས་ཡོངས་སུ་ཉེན་ནས་བདག་ལ་བཟའ་བ་སློང་དུ་ངེས་ཀྱི་བདག་གིས་ཁ་ཟས་སྦྱིན་པར་བྱའོ་སྙམ་ནས།
en: He also thought, ‘These ten thousand fish are definitely tormented by the fire of hunger and are begging me for food, so I will give them food.’

source: རིགས་ཀྱི་ལྷ་མོ་དེ་ནས་ཚོང་དཔོན་གྱི་ཁྱེའུ་ཆུ་འབེབས་ཀྱིས་རང་གིས་བུ་ཆུའི་གོས་ལ་འདི་སྐད་ཅེས་སྨྲས་སོ། །བུ་གླང་པོ་ཆེ་ཐམས་ཅད་ཀྱི་ནང་ནས་མགྱོགས་པའི་མཆོག་ལ་ཞོན་ཏེ་བདག་གི་ཁྱིམ་དུ་སོང་ལ། མྱུར་བ་མྱུར་བར་སོང་སྟེ་མེས་པོ་ཚོང་དཔོན་ལ། ཀྱེ་མེས་པོ་ཆུ་འབེབས་ཀྱི་མཆིད་ནས་ཁྱིམ་འདི་ན་ཕ་མ་དང་། སྤུན་དང་། སྲིང་མོ་དང་།
en: “Then, noble goddess, Jalavāhana, the head merchant’s son, said to his son Jalāmbara, ‘Mount the fastest one of these elephants, ride as quickly as you can to our home, and say to your grandfather, the head merchant, “O grandfather, Jalavāhana has said, ‘Put together as one all the food that my parents, brothers, sisters, male servants, female servants, and workmen have at home, and send it to me quickly in the hands of Jalāmbara riding the elephant!’ ” ’

source: བྲན་ཕོ་དང་། བྲན་མོ་དང་། ལས་བགྱིད་པ་རྣམས་ཀྱི་ཁ་ཟས་སྦྱར་བ་གང་ཅི་མཆིས་པ་ཐམས་ཅད་གཅིག་ཏུ་བསྡུས་ཏེ། ཆུའི་གོས་གླང་པོ་ཆེ་ལ་ཞོན་པའི་ལག་ཏུ་མྱུར་དུ་རྫོངས་ཤིག་ཅེས་མཆིའོ་ཞེས་དེ་སྐད་གྱིས་ཤིག །དེ་ནས་ཁྱེའུ་ཆུའི་གོས་གླང་པོ་ཆེ་དེ་ལ་ཞོན་ནས་མྱུར་བ་མྱུར་བར་རྒྱུག་ཅིང་རབ་ཏུ་རྒྱུག་སྟེ།
en: “Then the boy Jalāmbara, riding that elephant, rode and galloped as quickly as he could and came to his home.

source: རང་གི་ཁྱིམ་ག་ལ་བ་དེར་སོང་ནས་ཕྱིན་པ་དང་དེ་དག་རྒྱུས་ཀྱིས་ཞིབ་ཏུ་སྨྲས་ཏེ།
en: Arriving there, he told his story in detail.

source: དེ་ནས་ཁྱེའུ་ཆུའི་གོས་ཀྱིས་སྔར་སྨྲས་པའི་ཟས་སྦྱར་བ་དེ་ཐམས་ཅད་གླང་པོ་ཆེའི་རྒྱབ་ཏུ་བཀལ་ནས་གླང་པོ་ཆེ་དེ་ལ་ཞོན་ཏེ་དགོན་པ་ན་ཡོད་པའི་རྫིང་ག་ལ་བ་དེར་སོང་བ་དང་།
en: Then the boy Jalāmbara loaded onto the elephant all that combined food that he had been told to obtain, and he rode that elephant to the lake in the empty wilderness.

source: ཆུ་འབེབས་ཀྱིས་རང་གི་བུ་ཆུའི་གོས་མཐོང་ནས་དགའ་མགུ་སྟེ་བུ་ལས་ཟས་བླངས་ནས་ཕྲུལ་ཏེ་རྫིང་དེར་གཏོར་ནས་ཉ་ཁྲི་པོ་དེ་དག་ཚིམ་པར་བྱས་ཏེ། དེ་འདི་སྙམ་དུ་བདག་གིས་དུས་གཞན་ཞིག་ན་དགོན་པའི་གནས་ཞིག་ན།
en: “Jalavāhana was delighted to see his son Jalāmbara, received the food from his son, divided it, and scattered it in the lake, satisfying those ten thousand fish.

source: དགེ་སློང་ཐེག་པ་ཆེན་པོ་ཀློག་པ་ལས་སུ་འཆི་བའི་དུས་ཀྱི་ཚེ།
en: “He thought, ‘At another time, in a solitary place, I heard from a bhikṣu reading the Mahāyāna that someone who hears the name of the Tathāgata Ratnaśikhin at the time of death will be reborn in a happy existence in a higher world.

source: དེ་བཞིན་གཤེགས་པ་རིན་ཆེན་གཙུག་ཏོར་ཅན་གྱི་མཚན་ཐོས་པ་དེ་བདེ་འགྲོ་མཐོ་རིས་ཀྱི་འཇིག་རྟེན་དུ་སྐྱེའོ་ཞེས་ཐོས་ཀྱིས་བདག་གིས་ཉ་དེ་དག་ལ་རྟེན་ཅིང་འབྲེལ་པར་འབྱུང་བའི་ཆོས་ཟབ་མོ་ཡང་བཤད་ལ། དེ་བཞིན་གཤེགས་པ་དགྲ་བཅོམ་པ་ཡང་དག་པར་རྫོགས་པའི་སངས་རྒྱས་རིན་ཆེན་གཙུག་ཏོར་ཅན་དེའི་མཚན་ཡང་བསྒྲག་པར་བྱའོ་སྙམ་མོ། །
en: So I will teach the fish the profound Dharma of dependent origination and also recite the name of the tathāgata arhat samyak­saṃbuddha Ratnaśikhin.’

source: དེའི་ཚེ་ན་འཛམ་བུའི་གླིང་དེ་ན་སེམས་ཅན་རྣམས་ཀྱི་ལྟ་བ་གཉིས་སུ་གྱུར་ཏེ།
en: “At that time, the beings in Jambudvīpa had two views.

source: ཁ་ཅིག་ནི་ཐེག་པ་ཆེན་པོ་ལ་མངོན་པར་དད་དོ། །ཁ་ཅིག་ནི་སྨོད་དོ། །
en: Some had faith in the Mahāyāna and some disparaged it.

source: དེ་ནས་ཚོང་དཔོན་གྱི་བུ་ཁྱེའུ་ཆུ་འབེབས་ཀྱིས་དེའི་ཚེ་རྫིང་དེར་རྐང་པ་གཉི་གའི་པུས་མོ་ནུབ་ཙམ་དུ་འབོགས་ཏེ། བཅོམ་ལྡན་འདས་དེ་བཞིན་གཤེགས་པ་དགྲ་བཅོམ་པ་ཡང་དག་པར་རྫོགས་པའི་སངས་རྒྱས་རིན་ཆེན་གཙུག་ཏོར་ཅན་དེ་ལ་ཕྱག་འཚལ་ལོ་ཞེས་ཆེད་དུ་བརྗོད་པ་དེ་སྐད་ཆེད་དུ་བརྗོད་དོ། །
en: “Then, at that time, Jalavāhana, the head merchant’s son, stood in the lake up to his knees and recited: ‘Homage to the tathāgata arhat samyak­saṃbuddha Ratnaśikhin.

source: དེ་བཞིན་གཤེགས་པ་རིན་ཆེན་གཙུག་ཏོར་ཅན་སྔོན་བྱང་ཆུབ་སེམས་དཔའི་སྤྱད་པ་སྤྱོད་པ་ན། ཕྱོགས་བཅུ་དག་ན་གང་སུ་དག་འཆི་བའི་དུས་ཀྱི་ཚེ། ངའི་མིང་ཐོས་པ་དེ་དག་དེ་ནས་ཤི་འཕོས་ནས་སུམ་ཅུ་རྩ་གསུམ་གྱི་ལྷ་རྣམས་དང་སྐལ་བ་མཉམ་པར་སྐྱེ་བར་གྱུར་ཅིག་ཅེས་སྨོན་ལམ་དེ་སྐད་བཏབ་བོ། །
en: Previously, when the Tathāgata Ratnaśikhin was practicing bodhisattva conduct, he made this prayer: “May anyone in the ten directions who hears my name at the time of their death, after their passing be reborn with the good fortune of becoming devas in Trāyastriṃśa.” ’

source: དེ་ནས་ཚོང་དཔོན་གྱི་ཁྱེའུ་ཆུ་འབེབས་ཀྱིས་དུད་འགྲོའི་སྐྱེ་གནས་སུ་གྱུར་པ་དེ་དག་ལ་ཆོས་འདི་བཤད་དེ་འདི་ལྟ་སྟེ། འདི་ཡོད་པའི་ཕྱིར་འདི་འབྱུང་འདི་སྐྱེས་པས་འདི་སྐྱེ་བ་སྟེ། འདི་ལྟར་མ་རིག་པའི་རྐྱེན་གྱིས་འདུ་བྱེད་རྣམས། འདུ་བྱེད་རྣམས་ཀྱི་རྐྱེན་གྱིས་རྣམ་པར་ཤེས་པ།
en: “Then Jalavāhana, the head merchant’s son, taught this Dharma to those who had been reborn as animals: ‘Because this exists, that is produced; because this is born, that is born.

source: རྣམ་པར་ཤེས་པའི་རྐྱེན་གྱིས་མིང་དང་གཟུགས། མིང་དང་གཟུགས་ཀྱི་རྐྱེན་གྱིས་སྐྱེ་མཆེད་དྲུག །སྐྱེ་མཆེད་དྲུག་གི་རྐྱེན་གྱིས་རེག་པ། རེག་པའི་རྐྱེན་གྱིས་ཚོར་བ། ཚོར་བའི་རྐྱེན་གྱིས་སྲེད་པ། སྲེད་པའི་རྐྱེན་གྱིས་ལེན་པ། ལེན་པའི་རྐྱེན་གྱིས་སྲིད་པ། སྲིད་པའི་རྐྱེན་གྱིས་སྐྱེ་བ། སྐྱེ་བའི་རྐྱེན་གྱིས་རྒ་ཤི་དང་། མྱ་ངན་དང་། སྨྲེ་སྔགས་འདོན་པ་དང་།
en: In that way, because of the factor of ignorance, there is formation; because of the factor of formation, there is consciousness; because of the factor of consciousness, there is name and form; because of the factor of name and form, there are the six āyatanas; because of the factor of the six āyatanas, there is contact; because of the factor of contact, there is sensation; because of the factor of sensation, there is craving; because of the factor of craving, there is grasping; because of the factor of grasping, there is becoming; because of the factor of becoming, there is birth; because of the factor of birth, there is aging and death, misery, lamenting, suffering, unhappiness, and distress.

source: སྡུག་བསྔལ་བ་དང་།
en: In that way there is produced this great mass of nothing but suffering.

source: ཡིད་མི་བདེ་བ་དང་། འཁྲུག་པ་རྣམས་འབྱུང་བར་འགྱུར་ཏེ། དེ་ལྟར་ན་སྡུག་བསྔལ་གྱི་ཕུང་པོ་ཆེན་པོ་འདི་འབའ་ཞིག་འབྱུང་བར་འགྱུར་རོ། །འདི་ལྟ་སྟེ་མ་རིག་པ་འགགས་པས་འདུ་བྱེད་འགག་པར་འགྱུར་བ་ནས། དེ་ལྟར་སྡུག་བསྔལ་གྱི་ཕུང་པོ་ཆེན་པོ་འདི་འབའ་ཞིག་ཀྱང་འགག་པར་འགྱུར་རོ་ཞེས་བྱ་བའི་བར་དུའོ། །
en: “ ‘Thus, through the cessation of ignorance, formation ceases, and so on, until in that way this great mass of nothing but suffering ceases.’

source: རིགས་ཀྱི་ལྷ་མོ་དེ་ལྟར་དེའི་ཚེ་དེའི་དུས་ན་ཚོང་དཔོན་གྱི་བུ་ཆུ་འབེབས་ཀྱིས། དུད་འགྲོའི་སྐྱེ་གནས་སུ་གྱུར་པ་དེ་དག་ལ་ཆོས་དང་ལྡན་པའི་གཏམ་འདི་བརྗོད་ནས།
en: “Noble goddess, in that way, at that time, in that time, Jalavāhana, the head merchant’s son, recited those words of the Dharma to those who had been reborn as animals.

source: རང་གི་བུ་ཆུའི་གོས་དང་ཆུའི་སྙིང་པོ་དང་ལྷན་ཅིག་ཏུ་རང་གི་ཁྱིམ་དུ་ཕྱིན་པའི་བར་དུའོ། །
en: Then, together with his sons, Jalāmbara and Jalagarbha, he returned to his home.

source: དེ་ནས་དུས་གཞན་ཞིག་ན་ཚོང་དཔོན་གྱི་ཁྱེའུ་ཆུ་འབེབས་དུས་སྟོན་ཆེན་པོ་ཟོས་ནས་ཆང་གིས་ར་རོ་སྟེ་མལ་ན་ཉལ་བ་དང་།
en: “At another time, Jalavāhana, the head merchant’s son, ate a great feast and became intoxicated from alcohol, and then went to sleep in his bed.

source: དེའི་ཚེ་དེའི་དུས་ན་ལྟས་ཆེན་པོ་བྱུང་བར་གྱུར་ཏེ།
en: At that time, in that time, there appeared a great omen.

source: མཚན་མོ་དེ་འདས་པ་དང་། ཉ་ཁྲི་པོ་དེ་དག་འཆི་བའི་དུས་སུ་གྱུར་ནས་སུམ་ཅུ་རྩ་གསུམ་གྱི་ལྷ་རྣམས་དང་སྐལ་བ་མཉམ་པར་སྐྱེས་སོ། །
en: When that night had passed, it was time for the ten thousand fish to die, and they were reborn with the good fortune of becoming devas in Trāyastriṃśa.

source: སྐྱེས་མ་ཐག་ཏུ་དེ་དག་འདི་ལྟ་བུའི་ཚུལ་གྱིས་སེམས་ཀྱི་རྣམ་པར་རྟོག་པ་སྐྱེས་ཏེ། བདག་ཅག་དགེ་བའི་ལས་ཀྱི་རྒྱུ་གང་གིས་སུམ་ཅུ་རྩ་གསུམ་གྱི་ལྷ་རྣམས་ཀྱི་ནང་འདིར་སྐྱེས་སྙམ་མོ། །
en: As soon as they were born there, this manner of thought arose in their minds: ‘Through what good karma as a cause have we been reborn among the devas of Trāyastriṃśa?’

source: དེ་དག་ཀྱང་འདི་སྙམ་དུ་སེམས་ཏེ། བདག་ཅག་འཛམ་བུའི་གླིང་དེ་ན་ཉ་ཁྲིར་གྱུར་ཏེ་བདག་ཅག་དུད་འགྲོའི་སྐྱེ་གནས་སུ་གྱུར་པ་ལས། །
en: Then they thought, ‘We were ten thousand fish in Jambudvīpa.

source: ཚོང་དཔོན་གྱི་ཁྱེའུ་ཆུ་འབེབས་ཀྱིས་ཆུ་མང་པོ་དང་ཁ་ཟས་ཀྱི་མཆོག་གིས་ཚིམ་པར་བྱས་ཏེ། བདག་ཅག་ལ་རྟེན་ཅིང་འབྲེལ་པར་འབྱུང་བ་ཟབ་མོའི་ཆོས་ཀྱང་བསྟན།
en: We had been reborn as animals, but Jalavāhana, the head merchant’s son, satisfied us with much water and the most excellent food, and then he taught us the profound Dharma of dependent origination and recited the name of the tathāgata arhat samyak­saṃbuddha Ratnaśikhin.

source: དེ་བཞིན་གཤེགས་པ་དགྲ་བཅོམ་པ་ཡང་དག་པར་རྫོགས་པའི་སངས་རྒྱས་རིན་ཆེན་གཙུག་ཏོར་ཅན་གྱི་མཚན་ཡང་བསྒྲགས་པས་དགེ་བའི་ཆོས་ཀྱི་རྒྱུ་དེ་དང་རྐྱེན་དེས་བདག་ཅག་ལྷ་རྣམས་ཀྱི་ནང་འདིར་སྐྱེས་ཀྱིས།
en: It is through that good quality as a cause and as a condition that we have been reborn here among the Trāyastriṃśa devas.

source: བདག་ཅག་ཚོང་དཔོན་གྱི་ཁྱེའུ་ཆུ་འབེབས་ག་ལ་བ་དེར་དོང་སྟེ་ཕྱིན་ནས་དེ་ལ་མཆོད་པ་བྱའོ་སྙམ་མོ། །
en: We must go to where Jalavāhana, the head merchant’s son, is and, after arriving there, make offerings to him.’

source: དེ་ནས་ལྷའི་བུ་ཁྲི་པོ་དེ་དག་སུམ་ཅུ་རྩ་གསུམ་གྱི་ལྷ་རྣམས་ཀྱི་ནང་ནས་མི་སྣང་བར་གྱུར་ནས། ཚོང་དཔོན་གྱི་བུ་ཆུ་འབེབས་ཀྱི་ཁྱིམ་དུ་ལྷགས་ཏེ།
en: “Then those ten thousand devas vanished from among the Trāyastriṃśa devas and arrived at the home of Jalavāhana, the head merchant’s son.

source: དེའི་ཚེ་ཚོང་དཔོན་གྱི་ཁྱེའུ་ཆུ་འབེབས་མལ་ན་ཉལ་ཞིང་འདུག་པ་དེ་ལ་ལྷའི་བུ་དེ་དག་གིས་མུ་ཏིག་གི་སེ་མོ་དོ་ཁྲི་ནི་མགོའི་ཐད་ཀར་བཞག །
en: “At that time, Jalavāhana, the head merchant’s son, was sleeping on his bed, and those devas placed ten thousand pearl necklaces above his head.

source: མུ་ཏིག་གི་སེ་མོ་དོ་ཁྲི་ནི་རྐང་པའི་དྲུང་དུ་བཞག །
en: They placed a hundred thousand pearl necklaces in front of his feet.

source: མུ་ཏིག་གི་སེ་མོ་དོ་ཁྲི་ནི་གཡས་ལོགས་སུ་བཞག །
en: They placed a hundred thousand pearl necklaces to his right.

source: མུ་ཏིག་གི་སོ་མོ་དོ་ཁྲི་ནི་གཡོན་ལོགས་སུ་བཞག་སྟེ།
en: They placed a hundred thousand pearl necklaces to his left.

source: པུས་མོ་ནུབ་ཙམ་དུ་མེ་ཏོག་མན་དཱ་ར་བའི་ཆར་ཆེན་པོ་ཡང་ཕབ།
en: They also sent down a great rain of coral tree flowers that came up to the knees.

source: ལྷའི་སིལ་སྙན་རྣམས་ཀྱང་དཀྲོལ་ནས་དེས་འཛམ་བུའི་གླིང་གི་མི་ཐམས་ཅད་ཀྱང་སད། ཚོང་དཔོན་གྱི་ཁྱེའུ་ཆུ་འབེབས་ཀྱང་སད་དོ། །
en: They also played divine music that woke up everyone in Jambudvīpa.

source: དེ་ནས་ལྷའི་བུ་ཁྲི་པོ་དེ་དག་ཀྱང་ནམ་མཁའ་ལ་དོང་སྟེ། ལྷའི་བུ་དེ་དག་རྒྱལ་པོ་ལྷའི་དབང་ཕྱུག་འོད་ཀྱི་ཡུལ་གྱི་གནས་དང་གནས་གཞན་དུ་ཡང་། མེ་ཏོག་མན་དཱ་ར་བའི་ཆར་འབེབས་ཤིང་།
en: Then those ten thousand devas went up into the sky and sent down a rain of coral tree flowers here and there throughout the domain of King Sureśvara­prabha.

source: དགོན་པ་ན་ཡོད་པའི་རྫིང་ཆེན་པོ་ག་ལ་བ་དེར་དོང་ནས། དེ་དག་གིས་རྫིང་ཆེན་པོ་དེར་མེ་ཏོག་མན་དཱ་ར་བའི་ཆར་ཆེན་པོ་ཕབ་སྟེ།
en: Then they went to the great lake in the empty wilderness and sent down a great rain of coral tree flowers onto that great lake.

source: དེ་ཉིད་དུ་མི་སྣང་བར་གྱུར་ནས་སླར་ཡང་ལྷའི་གནས་སུ་དོང་སྟེ། དེ་ན་འདོད་པའི་ཡོན་ཏན་ལྔ་པོ་དག་གིས་དགའ་ཞིང་རྩེ་སྟེ། དགའ་མགུར་སྤྱོད་ཅིང་དཔལ་དང་སྐལ་བ་བཟང་པོ་ཆེན་པོ་དག་ཀྱང་མྱོང་ངོ་། །
en: Then they vanished from there and returned to their paradise, where they delighted and amused themselves with the five sensory pleasures, enjoyed pleasures, and experienced splendor and good fortune.

source: འཛམ་བུའི་གླིང་དུ་ནམ་ལངས་པ་དང་དེ་ནས་རྒྱལ་པོ་ལྷའི་དབང་ཕྱུག་འོད་ཀྱིས་ལྟས་དེ་དག་བྱུང་བ་མཐོང་ནས། སྐར་མཁན་དང་བློན་པོ་ཆེན་པོ་རྣམས་ལ་སྨྲས་པ། ཅིའི་ཕྱིར་མདང་སུམ་ལྟས་འདི་དག་བྱུང་།
en: “In Jambudvīpa, at dawn, King Sureśvara­prabha saw that these signs had occurred, and he asked his astrologers and prime ministers, ‘Why did these signs appear last night?’

source: དེ་དག་གིས་སྨྲས་པ། ལྷ་མཁྱེན་པར་མཛད་དུ་གསོལ། ཚོང་དཔོན་གྱི་ཁྱེའུ་ཆུ་འབེབས་ཀྱི་ཁྱིམ་དུ་མུ་ཏིག་གི་སེ་མོ་དོ་བཞི་ཁྲིའི་ཆར་བབ་ཅིང་ལྷའི་མེ་ཏོག་མན་དཱ་ར་བའི་ཆར་ཡང་འབབ་པོ་ཞེས་བྱས་པ་དང་།
en: “They answered, ‘Your Majesty should know this: a rain of forty thousand pearl necklaces and also a rain of divine coral tree flowers fell in the home of Jalavāhana, the head merchant’s son.’

source: རྒྱལ་པོ་ལྷའི་དབང་ཕྱུག་འོད་ཀྱིས་བློན་པོ་རྣམས་ལ་སྨྲས་པ། ཁྱེད་དེང་ལ་ཚོང་དཔོན་གྱི་བུ་ཆུ་འབེབས་ལ་སྙན་པའི་ཚིག་གིས་བོས་ཤིག །
en: “King Sureśvara­prabha said to his ministers, ‘You go and summon Jalavāhana, the head merchant’s son, with pleasant words.’

source: དེ་ནས་སྐར་མཁན་དང་བློན་པོ་ཆེན་པོ་རྣམས་ཆུ་འབེབས་ཀྱི་ཁྱིམ་ག་ལ་བ་དེར་དོང་སྟེ་ཕྱིན་ནས། ཚོང་དཔོན་གྱི་ཁྱེའུ་ཆུ་འབེབས་ལ་འདི་སྐད་ཅེས་སྨྲས་སོ། །རྒྱལ་པོ་ལྷའི་དབང་ཕྱུག་འོད་འདི་ཁྱོད་ལ་འབོད་དོ། །
en: “Then the astrologers and prime ministers went to the home of Jalavāhana, the head merchant’s son, and having arrived they said to Jalavāhana, the head merchant’s son, ‘King Sureśvara­prabha is summoning you.’

source: དེ་ནས་ཚོང་དཔོན་གྱི་ཁྱེའུ་ཆུ་འབེབས་བློན་པོ་ཆེན་པོ་རྣམས་དང་ལྷན་ཅིག་ཏུ་རྒྱལ་པོ་ལྷའི་དབང་ཕྱུག་འོད་ག་ལ་བ་དེར་དོང་བ་དང་། རྒྱལ་པོས་སྨྲས་པ།
en: “Then Jalavāhana, the head merchant’s son, went with the prime ministers to King Sureśvara­prabha.

source: བུ་ཆུ་འབེབས་མདང་སུམ་དེ་འདྲ་བའི་ལྟས་བྱུང་བ།
en: “King Sureśvara­prabha said to him, ‘Jalavāhana, such kinds of signs appeared last night.

source: དེ་ཅིའི་ལྟས་ཡིན་ཤེས་སམ།
en: Do you know why there were those signs?’

source: དེ་ནས་ཚོང་དཔོན་གྱི་ཁྱེའུ་ཆུ་འབེབས་ཀྱིས་རྒྱལ་པོ་ལྷའི་དབང་ཕྱུག་འོད་ལ་འདི་སྐད་ཅེས་སྨྲས་སོ། །ལྷ་བདག་གིས་འཚལ་ཏེ་ཉ་ཁྲི་པོ་དེ་དག་འཆི་བའི་དུས་བགྱིས་པར་ངེས་སོ། །
en: “Then Jalavāhana, the head merchant’s son, said to King Sureśvara­prabha, ‘Your Majesty, I know that the time of death definitely came for those ten thousand fish.’

source: རྒྱལ་པོས་སྨྲས་པ། ཇི་ལྟར་ཤེས་ཆུ་འབེབས་ཀྱིས་སྨྲས་པ།
en: “The king asked, ‘How do you know that, Jalavāhana?’

source: ལྷ་ཆུའི་གོས་རྫིང་དེར་ཉ་ཁྲི་པོ་དེ་དག་གུམ་མམ་མ་གུམ་ལྟར་སྩལ་ཏོ། །
en: “ ‘Your Majesty,’ said Jalavāhana, ‘I will send Jalāmbara to that lake to see whether those ten thousand fish are dead or alive.’

source: རྒྱལ་པོས་སྨྲས་པ། དེ་ལྟར་གྱིས་ཤིག །
en: “ ‘Do that!’ commanded the king.

source: དེ་ནས་ཚོང་དཔོན་གྱི་ཁྱེའུ་ཆུ་འབེབས་ཀྱིས་ཁྱེའུ་ཆུའི་གོས་ལ་འདི་སྐད་ཅེས་སྨྲས་སོ། །བུ་སོང་ལ་དགོན་པ་ན་ཡོད་པའི་རྫིང་བུའི་ཉ་ཁྲི་པོ་དེ་དག་ཤི་འམ་མ་ཤི་ལྟོས་ཤིག །
en: “Then Jalavāhana, the head merchant’s son, said to his son Jalāmbara, ‘Son, go to see whether the ten thousand fish in the lake in the empty wilderness have died or not.’

source: དེ་ནས་ཁྱེའུ་ཆུའི་གོས་མྱུར་བ་མྱུར་བར་དགོན་པ་ན་ཡོད་པའི་རྫིང་ཆེན་པོ་ག་ལ་བ་དེར་སོང་བ་དང་། ཉ་ཁྲི་པོ་དེ་དག་ཤི་བའི་དུས་སུ་གྱུར་ཅིང་མེ་ཏོག་མན་དཱ་ར་བའི་ཆར་ཆེན་པོ་བབ་པ་ཡང་མཐོང་ནས་སླར་ལོག་སྟེ་ཕ་ལ་སྨྲས་བ།
en: “Then the son, Jalāmbara, went as quickly as he could to that great lake in the empty wilderness and saw that the time of death had come for those ten thousand fish and that a great rain of coral tree flowers had fallen there.

source: འཆི་བའི་དུས་སུ་གྱུར་ཏོ། །
en: He returned and said to his father, ‘Their time of death had come.’

source: དེ་ནས་ཚོང་དཔོན་གྱི་ཁྱེའུ་ཆུ་འབེབས་ཀྱིས་ཁྱེའུ་ཆུའི་གོས་ལས་ཚིག་དེ་ཐོས་པ་དང་། རྒྱལ་པོ་ལྷའི་དབང་ཕྱུག་འོད་ག་ལ་བ་དེར་སོང་ནས་དེ་དག་རྒྱུས་ནས་ཞིབ་ཏུ་སྨྲས་ཏེ། ལྷ་མཁྱེན་པར་མཛད་དུ་གསོལ། ཉ་ཁྲི་པོ་དེ་དག་ཐམས་ཅད་ནི་འཆི་བའི་དུས་སུ་གྱུར་ནས་སུམ་ཅུ་རྩ་གསུམ་གྱི་ལྷ་རྣམས་ཀྱི་ནང་དུ་སྐྱེས་ཏེ།
en: “Then Jalavāhana, the head merchant’s son, having heard those words, went to King Sureśvara­prabha and told him in detail what had occurred: ‘The time of death had come to all those ten thousand fish, and they were reborn among the devas of Trāyastriṃśa.

source: དེ་དག་དང་བདག་གི་མཐུས་མདང་སུམ་དེ་ལྟ་བུའི་དགེ་བའི་ལྟས་དེ་དག་བྱུང་སྟེ།
en: It is through their and my power that those good signs appeared last night.

source: བདག་གི་ཁྱིམ་དུ་ཡང་མུ་ཏིག་གི་སེ་མོ་དོ་བཞི་ཁྲི་དང་ལྷའི་མེ་ཏོག་མན་དཱ་ར་བའི་ཆར་ཡང་ཕབ་བོ། །
en: There also fell a rain of forty thousand strings of pearls and divine coral tree flowers in my home.’

source: དེ་ནས་རྒྱལ་པོ་དགའ་ཞིང་མགུ་སྟེ་ཡི་རང་པར་གྱུར་ཏོ། །
en: “Then the king was happy, pleased, and overjoyed.”

source: དེ་ནས་བཅོམ་ལྡན་འདས་ཀྱིས་རིགས་ཀྱི་ལྷ་མོ་བྱང་ཆུབ་ཡང་དག་པར་བསྡུས་པ་ལ་འདི་སྐད་ཅེས་བཀའ་སྩལ་ཏོ། །རིགས་ཀྱི་ལྷ་མོ་དེའི་ཚེ་དེའི་དུས་ན། རྒྱལ་པོ་ལྷའི་དབང་ཕྱུག་འོད་ཅེས་བྱ་བར་གྱུར་པ་དེ་གཞན་ཞིག་ཡིན་པ་སྙམ་དུ་ཁྱོད་སེམས་ན་དེ་དེ་ལྟར་མི་བལྟའོ། །
en: The Bhagavat then said to the goddess Bodhisattvasamuccayā, “Noble goddess, do not hold the view of thinking that at that time, in that time, King Sureśvara­prabha was anyone else.

source: ཤཱཀྱ་ལག་ན་བེ་ཅོན་ཅན་དེའི་ཚེ་དེའི་དུས་ན་རྒྱལ་པོ་ལྷའི་དབང་ཕྱུག་འོད་ཅེས་བྱ་བར་གྱུར་ཏོ། །
en: It is because during that time the Śākya Daṇḍapāṇi was King Sureśvara­prabha.

source: རིགས་ཀྱི་ལྷ་མོ་དེའི་ཚེ་དེའི་དུས་ན། ཚོང་དཔོན་རལ་པ་འཛིན་ཅེས་བྱ་བར་གྱུར་པ་དེ་གཞན་ཞིག་ཡིན་པ་སྙམ་དུ་ཁྱོད་སེམས་ན་དེ་དེ་ལྟར་མི་བལྟའོ། །
en: “Noble goddess, do not hold the view of thinking that at that time, in that time, the head merchant Jaṭiṃdhara was anyone else.

source: རྒྱལ་པོ་ཟས་གཙང་མ་དེའི་ཚེ་དེའི་དུས་ན། ཚོང་དཔོན་རལ་པ་འཛིན་ཅེས་བྱ་བར་གྱུར་ཏོ། །
en: It is because during that time King Śuddhodana was the head merchant Jaṭiṃdhara.

source: རིགས་ཀྱི་ལྷ་མོ་དེའི་ཚེ་དེའི་དུས་ན། ཚོང་དཔོན་གྱི་ཁྱེའུ་ཆུ་འབེབས་ཞེས་བྱ་བ་དེ་གཞན་ཞིག་ཡིན་པ་སྙམ་དུ་ཁྱོད་སེམས་ན། དེ་དེ་ལྟར་མི་བལྟའོ། །
en: “Noble goddess, do not hold the view of thinking that at that time, in that time, Jalavāhana, the head merchant’s son, was anyone else.

source: ང་དེའི་ཚེ་དེའི་དུས་ན་ཚོང་དཔོན་གྱི་བུ་ཆུ་འབེབས་ཞེས་བྱ་བར་གྱུར་ཏོ། །
en: It is because during that time I was Jalavāhana, the head merchant’s son.

source: རིགས་ཀྱི་ལྷ་མོ་དེའི་ཚེ་དེའི་དུས་ན། ཆུང་མ་ཆུའི་པདྨའི་སྙིང་པོ་ཞེས་བྱ་བར་གྱུར་པ་དེ་གཞན་ཞིག་ཡིན་པ་སྙམ་དུ་ཁྱོད་སེམས་ན་དེ་དེ་ལྟར་མི་བལྟའོ། །
en: “Noble goddess, do not hold the view of thinking that at that time, in that time, his wife, Jalāmbuja­garbhā, was anyone else.

source: ཤཱཀྱའི་བུ་མོ་ས་འཚོ་མ་དེའི་ཚེ་དེའི་དུས་ན། ཚོང་དཔོན་གྱི་བུ་ཁྱེའུ་ཆུ་འབེབས་ཞེས་བྱ་བའི་ཆུང་མ་ཆུའི་པདྨའི་སྙིང་པོ་ཞེས་བྱ་བར་གྱུར་ཏོ། །སྒྲ་གཅན་ཟིན་ནི་དེའི་ཚེ་དེའི་དུས་ན།
en: It is because during that time the Śākya maiden Gopā was his wife, Jalāmbuja­garbhā.

source: ཁྱེའུ་ཆུའི་གོས་ཞེས་བྱ་བར་གྱུར་ཏོ། །
en: “Rāhula was at that time the son Jalāmbara, and Ānanda was at that time the son Jalagarbha.

source: ཀུན་དགའ་བོ་ནི་དེའི་ཚེ་དེའི་དུས་ན། ཁྱེའུ་ཆུའི་སྙིང་པོ་ཞེས་བྱ་བར་གྱུར་ཏོ། །རིགས་ཀྱི་ལྷ་མོ་དེའི་ཚེ་དེའི་དུས་ན་ཉ་ཁྲི་པོར་གྱུར་པ་དེ་དག་གཞན་ཞིག་ཡིན་པ་སྙམ་དུ་ཁྱོད་སེམས་ན་དེ་དེ་ལྟར་མི་བལྟའོ། །
en: “Noble goddess, do not hold the view of thinking that at that time, in that time, the ten thousand fish were anyone else.

source: འབར་བའི་ཁྱད་པར་གྱི་གཟི་བརྗིད་རྒྱལ་པོ་ལ་སོགས་པ་ལྷའི་བུ་ཁྲི་པོ་འདི་དག་དེའི་ཚེ་དེའི་དུས་ན་ཉ་ཁྲིར་གྱུར་ཏེ། གང་དག་ངས་ཆུ་དང་ཟས་ཀྱི་མཆོག་གིས་ཚིམ་པར་བྱས་ཤིང་རྟེན་ཅིང་འབྲེལ་པར་འབྱུང་བ་ཟབ་མོའི་ཆོས་ཀྱང་བསྟན། དེ་བཞིན་གཤེགས་པ་དགྲ་བཅོམ་པ་ཡང་དག་པར་རྫོགས་པའི་སངས་རྒྱས་རིན་ཆེན་གཙུག་ཏོར་ཅན་གྱི་མཚན་ཡང་བསྒྲགས་ཏེ།
en: It is because during that time Jvalanāntara­tejo­rāja and the rest of these ten thousand devas were those ten thousand fish that I satisfied with water and excellent food, to whom I taught the profound Dharma of dependent origination, and to whom I recited the name of the tathāgata arhat samyak­saṃbuddha Ratnaśikhin.

source: དགེ་བའི་ལས་ཀྱི་རྒྱུ་དེས་ངའི་གན་དུ་འདིར་ལྷགས་ཏེ། དེས་ན་ད་ལྟར་བླ་ན་མེད་པ་ཡང་དག་པར་རྫོགས་པའི་བྱང་ཆུབ་ཏུ་ལུང་བསྟན་ཏོ། །
en: It is because of that good action as a cause that they arrived here and that I have given them the prophecy of their attainment of the highest, most complete enlightenment.

source: རབ་ཏུ་དགའ་བ་དང་དང་བ་དང་མཆོག་ཏུ་དགའ་བ་དང་། གུས་པར་ཆོས་ཉན་པས་ཐམས་ཅད་ལུང་བསྟན་པ་ཞེས་བྱ་བའི་མིང་ཡང་ཐོབ་པར་གྱུར་ཏོ། །
en: Because they listened to the Dharma reverently with complete delight, trust, and supreme joy, they have received their prophecies and names.

source: རིགས་ཀྱི་ལྷ་མོ་དེའི་ཚེ་དེའི་དུས་ན། ཤིང་གི་ལྷ་མོར་གྱུར་པ་དེ་གཞན་ཞིག་ཡིན་པ་སྙམ་དུ་ཁྱོད་སེམས་ན་དེ་དེ་ལྟར་མི་བལྟའོ། །
en: “Noble goddess, do not hold the view of thinking that at that time, in that time, the tree goddess was anyone else.

source: རིགས་ཀྱི་ལྷ་མོ་ཁྱོད་དེའི་ཚེ་དེའི་དུས་ན་ཤིང་གི་ལྷ་མོར་གྱུར་ཏོ། །
en: It is because during that time you were that tree goddess.
